{
  "_dpo_sensitivity_cache": {
    "model.layers.0.self_attn.q_proj": 0.018176739461655662,
    "model.layers.0.self_attn.v_proj": 0.0,
    "model.layers.1.self_attn.q_proj": 0.016957846622651093,
    "model.layers.1.self_attn.v_proj": 0.0019045200609446417,
    "model.layers.10.self_attn.q_proj": 0.03,
    "model.layers.10.self_attn.v_proj": 0.011046216353478923,
    "model.layers.11.self_attn.q_proj": 0.02731843575418994,
    "model.layers.11.self_attn.v_proj": 0.01244794311833418,
    "model.layers.12.self_attn.q_proj": 0.02670898933468766,
    "model.layers.12.self_attn.v_proj": 0.012143219908583035,
    "model.layers.13.self_attn.q_proj": 0.028781107160995426,
    "model.layers.13.self_attn.v_proj": 0.012630777044184865,
    "model.layers.14.self_attn.q_proj": 0.0282935500253936,
    "model.layers.14.self_attn.v_proj": 0.012874555611985779,
    "model.layers.15.self_attn.q_proj": 0.029634332148298626,
    "model.layers.15.self_attn.v_proj": 0.012204164550533265,
    "model.layers.16.self_attn.q_proj": 0.0282935500253936,
    "model.layers.16.self_attn.v_proj": 0.011899441340782123,
    "model.layers.17.self_attn.q_proj": 0.028049771457592684,
    "model.layers.17.self_attn.v_proj": 0.011289994921279838,
    "model.layers.18.self_attn.q_proj": 0.0265871000507872,
    "model.layers.18.self_attn.v_proj": 0.01159471813103098,
    "model.layers.19.self_attn.q_proj": 0.0274403250380904,
    "model.layers.19.self_attn.v_proj": 0.012996444895886236,
    "model.layers.2.self_attn.q_proj": 0.026952767902488572,
    "model.layers.2.self_attn.v_proj": 0.00574403250380904,
    "model.layers.20.self_attn.q_proj": 0.027927882173692232,
    "model.layers.20.self_attn.v_proj": 0.012935500253936008,
    "model.layers.21.self_attn.q_proj": 0.0274403250380904,
    "model.layers.21.self_attn.v_proj": 0.013362112747587607,
    "model.layers.22.self_attn.q_proj": 0.02731843575418994,
    "model.layers.22.self_attn.v_proj": 0.014641950228542406,
    "model.layers.23.self_attn.q_proj": 0.02670898933468766,
    "model.layers.23.self_attn.v_proj": 0.014641950228542406,
    "model.layers.24.self_attn.q_proj": 0.02707465718638903,
    "model.layers.24.self_attn.v_proj": 0.016714068054850175,
    "model.layers.25.self_attn.q_proj": 0.026952767902488572,
    "model.layers.25.self_attn.v_proj": 0.01793296089385475,
    "model.layers.26.self_attn.q_proj": 0.027927882173692232,
    "model.layers.26.self_attn.v_proj": 0.01537328593194515,
    "model.layers.27.self_attn.q_proj": 0.02707465718638903,
    "model.layers.27.self_attn.v_proj": 0.019395632300660232,
    "model.layers.28.self_attn.q_proj": 0.027684103605891314,
    "model.layers.28.self_attn.v_proj": 0.018908075165058404,
    "model.layers.29.self_attn.q_proj": 0.02670898933468766,
    "model.layers.29.self_attn.v_proj": 0.01988318943626206,
    "model.layers.3.self_attn.q_proj": 0.022564753682072117,
    "model.layers.3.self_attn.v_proj": 0.00781615033011681,
    "model.layers.30.self_attn.q_proj": 0.029146775012696798,
    "model.layers.30.self_attn.v_proj": 0.0223209751142712,
    "model.layers.31.self_attn.q_proj": 0.027196546470289483,
    "model.layers.31.self_attn.v_proj": 0.02122397155916709,
    "model.layers.4.self_attn.q_proj": 0.02244286439817166,
    "model.layers.4.self_attn.v_proj": 0.007511427120365667,
    "model.layers.5.self_attn.q_proj": 0.026952767902488572,
    "model.layers.5.self_attn.v_proj": 0.007633316404266124,
    "model.layers.6.self_attn.q_proj": 0.0265871000507872,
    "model.layers.6.self_attn.v_proj": 0.008425596749619096,
    "model.layers.7.self_attn.q_proj": 0.02646521076688674,
    "model.layers.7.self_attn.v_proj": 0.009583544946673439,
    "model.layers.8.self_attn.q_proj": 0.027927882173692232,
    "model.layers.8.self_attn.v_proj": 0.00994921279837481,
    "model.layers.9.self_attn.q_proj": 0.02731843575418994,
    "model.layers.9.self_attn.v_proj": 0.011838496698831894
  },
  "adaptive_with_dpo": true,
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/data/students_user/2024/lr/model/Llama-3.1-8B-Instruct",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 50,
  "dpo_importance_scale": 0.002,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 32,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {
    "model.layers.0.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.0.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.1.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.1.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.10.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.10.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true
    ],
    "model.layers.11.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.11.self_attn.v_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      true
    ],
    "model.layers.12.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.12.self_attn.v_proj.lora_E": [
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      false
    ],
    "model.layers.13.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.13.self_attn.v_proj.lora_E": [
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      true,
      true,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      false,
      true,
      false
    ],
    "model.layers.14.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.14.self_attn.v_proj.lora_E": [
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      true,
      true,
      true,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.15.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.15.self_attn.v_proj.lora_E": [
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false
    ],
    "model.layers.16.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.16.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      true,
      true,
      true,
      false,
      false,
      true,
      false,
      false,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      false
    ],
    "model.layers.17.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      true,
      false,
      true,
      true
    ],
    "model.layers.17.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      true,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.18.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.18.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.19.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.19.self_attn.v_proj.lora_E": [
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.2.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.2.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.20.self_attn.q_proj.lora_E": [
      false,
      true,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true
    ],
    "model.layers.20.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.21.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.21.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.22.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true
    ],
    "model.layers.22.self_attn.v_proj.lora_E": [
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.23.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true
    ],
    "model.layers.23.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.24.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.24.self_attn.v_proj.lora_E": [
      true,
      true,
      true,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      true,
      false,
      false,
      false,
      true,
      true,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      true,
      true,
      true,
      true,
      false,
      false
    ],
    "model.layers.25.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true
    ],
    "model.layers.25.self_attn.v_proj.lora_E": [
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true
    ],
    "model.layers.26.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.26.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false
    ],
    "model.layers.27.self_attn.q_proj.lora_E": [
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.27.self_attn.v_proj.lora_E": [
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      false
    ],
    "model.layers.28.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.28.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.29.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.29.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      false,
      true,
      false
    ],
    "model.layers.3.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.3.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.30.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.30.self_attn.v_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      true,
      true,
      false,
      false,
      true,
      true
    ],
    "model.layers.31.self_attn.q_proj.lora_E": [
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.31.self_attn.v_proj.lora_E": [
      false,
      true,
      false,
      true,
      true,
      true,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.4.self_attn.q_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.4.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.5.self_attn.q_proj.lora_E": [
      false,
      false,
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      true,
      true
    ],
    "model.layers.5.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false
    ],
    "model.layers.6.self_attn.q_proj.lora_E": [
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      false,
      true,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.6.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      false
    ],
    "model.layers.7.self_attn.q_proj.lora_E": [
      true,
      true,
      false,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      false,
      true,
      true,
      true,
      false,
      true,
      true,
      false
    ],
    "model.layers.7.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      false,
      true,
      true,
      false,
      false,
      true,
      false,
      false,
      false,
      true,
      false,
      true
    ],
    "model.layers.8.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true
    ],
    "model.layers.8.self_attn.v_proj.lora_E": [
      false,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      true,
      false,
      false,
      false,
      false,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      false,
      false,
      false,
      true,
      false,
      true,
      true,
      true,
      true
    ],
    "model.layers.9.self_attn.q_proj.lora_E": [
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      true,
      false,
      true,
      true,
      true
    ],
    "model.layers.9.self_attn.v_proj.lora_E": [
      false,
      true,
      true,
      true,
      true,
      false,
      false,
      false,
      true,
      false,
      true,
      false,
      true,
      false,
      true,
      false,
      false,
      true,
      false,
      true,
      true,
      false,
      true,
      true,
      true,
      false,
      false,
      false,
      true,
      true,
      true,
      false
    ]
  },
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "target_r": 16,
  "task_type": "CAUSAL_LM",
  "tfinal": 3000,
  "tinit": 200,
  "total_step": 3750,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}